# Дан список чисел. Определите, сколько в нем встречается различных чисел.
list = [1,1,2,0,-1,3,4,4] # список
print(len(set(list)))   # печать(узнаем длинну(создаем множество(список)))